# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysTypeSet..::..ForwardIterator Method
DistributionSysTypeSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual DistributionSysTypeSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As DistributionSysTypeSetIterator
```

Visual C++
---
```text
public:
virtual DistributionSysTypeSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace